УТ_для_edt/src/Documents/смартРегламентноеОбслуживаниеКлиентов/смартРегламентноеОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>смартРегламентноеОбслуживаниеКлиентов</name>
  <comment>// смарт:ММ #099 409 25.03.2021</comment>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Оборудование</name>
    <type>
      <types>CatalogRef.смартОборудованиеКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаТОУКлиента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокЗамены</name>
    <type>
      <types>EnumRef.смартСрокиЗаменыЗапчастей</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодписанияАктаНаПНР</name>
    <comment>// 03.12.2020</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>//смарт:ММ 30.05.2021</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>DocumentRef.смартЗаявкаНаПускоНаладку</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>EnumRef.смартСтатусыРегламентногоОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <comment>// 05.06.2021</comment>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначенныйМенеджерСЦ</name>
    <comment>//смарт:ММ 30.08.2021</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Запчасть</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ_для_edt/src/Enums/смартСтатусыРегламентногоОбслуживания/смартСтатусыРегламентногоОбслуживания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыРегламентногоОбслуживания</name>
  <comment>// 05.06.2021</comment>
  <enumValues>
    <name>НеобходимоСвязатьсяСКлиентом</name>
  </enumValues>
  <enumValues>
    <name>СКлиентомСозвонились</name>
  </enumValues>
  <enumValues>
    <name>ПредложениеПоТООтправлено</name>
  </enumValues>
  <enumValues>
    <name>ПовторныйЗвонокКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ВыставленСчетНаКомплект</name>
  </enumValues>
  <enumValues>
    <name>СчетОплачен</name>
  </enumValues>
  <enumValues>
    <name>ТОВыполнено</name>
  </enumValues>
  <enumValues>
    <name>КлиентОтказалсяОтПрохожденияТО</name>
  </enumValues>
  <enumValues>
    <name>ОформленаЗаявкаНаВыездИнженера</name>
    <comment>//смарт:ММ 30.08.2021</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/смартРегламентноеОбслуживаниеКлиентов/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
	//++ смарт:ММ 596 30.08.2021
	//НайтиЗаявкуНаРемонтныеРаботы();
	//-- #Б1298 смарт: Шляпников 08.11.2024
	
	ЗаметкиПоДокументу.Параметры.УстановитьЗначениеПараметра("Предмет", Объект.Ссылка);
	Если НЕ ЗначениеЗаполнено(Объект.НазначенныйМенеджерСЦ) Тогда
		Элементы.НазначенныйМенеджерСЦ.ПодсказкаВвода = Объект.Клиент.смартОсновнойМенеджерСервисЦентра;
	КонецЕсли;
	
	//-- смарт:ММ 30.08.2021
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область ОбработчикиКомандФормы

//++ смарт:ММ 596 27.08.2021
&НаКлиенте
Процедура ПривязатьЗаказКлиента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не записан. Действие не может быть выполнено.");		
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("Партнер", 		Объект.Клиент);
	Отбор.Вставить("Контрагент", 	Объект.Контрагент);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПривязатьЗаказКлиентаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 27.08.2021
&НаКлиенте
Процедура ОтвязатьОтЗаказаКлиента(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не записан. Действие не может быть выполнено.");		
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ДокументОснование", Объект.Ссылка);
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
	ПараметрыОткрытия.Вставить("Отбор", Отбор);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ОтвязатьЗаказКлиентаЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма,,,, ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	

КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 30.08.2021
&НаКлиенте
Процедура ДобавитьЗаметку(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Предмет", Объект.Ссылка);
	
	Оповещение = Новый ОписаниеОповещения("ПослеДобавленияЗаметки", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаЭлемента", ПараметрыФормы, ЗаметкиПоДокументу,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
&НаКлиенте
Процедура ПривязатьЗаявкаНаРемонтныеРаботы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не записан. Действие не может быть выполнено.");		
		Возврат;
	КонецЕсли;
	
	СуществующаяСвязьСЗаявкой = НайтиЗаявкуНаРемонтныеРаботы();
	Если ЗначениеЗаполнено(СуществующаяСвязьСЗаявкой) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Уже существует связь с %1", СуществующаяСвязьСЗаявкой), СуществующаяСвязьСЗаявкой);
		Возврат;
	КонецЕсли;
	
	МассивПодходящихЗаявокНаРемонт = НайтиЗаявкиНаРемонтПоОборудованиюИСерии();
	Если МассивПодходящихЗаявокНаРемонт.Количество() = 0 Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрШаблон("Не найдено заявок на ремонт с оборудованием '%1' и серией '%2'", 
															  Объект.Оборудование, Объект.Серия));
		Возврат;
	ИначеЕсли МассивПодходящихЗаявокНаРемонт.Количество() = 1 Тогда
		ПривязатьЗаявкаНаРемонтныеРаботыЗавершение(МассивПодходящихЗаявокНаРемонт[0], Новый Структура);
	Иначе
	
		ПараметрыОткрытия = Новый Структура;
		ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
		ПараметрыОткрытия.Вставить("МножественныйВыбор", Ложь);
		ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе", Истина);
		ПараметрыОткрытия.Вставить("Отбор", Новый Структура("Ссылка", МассивПодходящихЗаявокНаРемонт));
		
		ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("ПривязатьЗаявкаНаРемонтныеРаботыЗавершение", ЭтотОбъект);
		
		ОткрытьФорму("Документ.смартЗаявкаНаРемонтныеРаботы.Форма.ФормаВыбора", ПараметрыОткрытия, ЭтаФорма, , , , 
					 ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
&НаКлиенте
Процедура ОтвязатьЗаявкаНаРемонтныеРаботы(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Документ не записан. Действие не может быть выполнено.");		
		Возврат;
	КонецЕсли;
	
	СуществующаяСвязьСЗаявкой = НайтиЗаявкуНаРемонтныеРаботы();
	Если НЕ ЗначениеЗаполнено(СуществующаяСвязьСЗаявкой) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не существует связи с заявкой на ремонтые работы. Отвязка не может быть произведена");
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗаявкаНаРемонт", СуществующаяСвязьСЗаявкой);
			
	Оповещение = Новый ОписаниеОповещения("ВопросПередОтвязкойДокументОснованияЗаявкиНаРемонтныеРаботыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ТекстВопроса = НСтр(СтрШаблон("ru = 'Вы уверены, что хотите отвязать связь с %1'", СуществующаяСвязьСЗаявкой));
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	
КонецПроцедуры

#КонецОбласти

#Область ПривязкаОтвязкаЗаявкиНаРемонтныеРаботы

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
&НаСервере
Процедура ЗаполнитьДокументОснованиеВЗаявкеНаРемонт(ЗаявкаНаРемонт, Отвязать = Ложь)
	
	Модифицированность = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = ЗаявкаНаРемонт.ПолучитьОбъект();
	Если Отвязать Тогда
		ДокОбъект.ДокументОснование = Неопределено;
	Иначе
		ДокОбъект.ДокументОснование = Объект.Ссылка;
	КонецЕсли;
	
	Попытка
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		ЭтотОбъект.Записать();
		
		Если Отвязать Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для документа %1 сброшена связь с документом %2", ЗаявкаНаРемонт, Объект.Ссылка), ЗаявкаНаРемонт);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Для документа %1 указан документ-основание %2", ЗаявкаНаРемонт, Объект.Ссылка), ЗаявкаНаРемонт);
		КонецЕсли;
	Исключение
		ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не удалось записать документ %1 по причине %2%3", ЗаявкаНаРемонт, Символы.ПС, ОписаниеОшибки()), ЗаявкаНаРемонт);
	КонецПопытки;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
&НаКлиенте
Процедура ПривязатьЗаявкаНаРемонтныеРаботыЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия <> Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") Тогда
		
		ДокОснование = ПолучитьРеквизитОбъекта(РезультатЗакрытия, "ДокументОснование");
		
		Если ЗначениеЗаполнено(ДокОснование) Тогда
			
			Если ДокОснование = Объект.Ссылка Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("В выбранной заявке на ремонт уже привязан текущий документ");
				Возврат;
			КонецЕсли;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЗаявкаНаРемонт", РезультатЗакрытия);
			
			Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемДокументОснованияЗаявкиНаРемонтныеРаботыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ТекстВопроса = НСтр("ru = 'В заявке на ремонт уже заполнен документ-основание. Заменить документ-основание на текущий?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Иначе
			ЗаполнитьДокументОснованиеВЗаявкеНаРемонт(РезультатЗакрытия);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
Функция НайтиЗаявкиНаРемонтПоОборудованиюИСерии()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.смартЗаявкаНаРемонтныеРаботы.Оборудование КАК Т
	|ГДЕ
	|	Т.Серия = &Серия
	|	И НЕ Т.Ссылка.ПометкаУдаления
	|	И Т.ОборудованиеКлиентов = &Оборудование";
	
	Запрос.УстановитьПараметр("Оборудование", Объект.Оборудование);
	Запрос.УстановитьПараметр("Серия", Объект.Серия);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
&НаКлиенте
Процедура ВопросПередЗаполнениемДокументОснованияЗаявкиНаРемонтныеРаботыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		ЗаполнитьДокументОснованиеВЗаявкеНаРемонт(ДополнительныеПараметры.ЗаявкаНаРемонт);		
	КонецЕсли;
	
КонецПроцедуры

//++ #Б1298 смарт: Шляпников 08.11.2024 / Механизм связки документов в рамках задачи Доплнительно гарантии
&НаКлиенте
Процедура ВопросПередОтвязкойДокументОснованияЗаявкиНаРемонтныеРаботыЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		ЗаполнитьДокументОснованиеВЗаявкеНаРемонт(ДополнительныеПараметры.ЗаявкаНаРемонт, Истина);		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти


//++ смарт:ММ #099 409 05.06.2021
&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	Объект.Серия = ПолучитьСерию(Объект.Оборудование, Объект.ДокументОснование);
КонецПроцедуры //-- смарт:ММ 05.06.2021

//++ смарт:ММ #099 409 05.06.2021
&НаСервереБезКонтекста
Функция ПолучитьСерию(Оборудование, ЗаявкаНаПНР)
		
	Возврат Документы.смартРегламентноеОбслуживаниеКлиентов.ПолучитьСерию(Оборудование, ЗаявкаНаПНР);	
	
КонецФункции //-- смарт:ММ 05.06.2021

//++ смарт:ММ 596 30.08.2021
&НаСервере
Функция НайтиЗаявкуНаРемонтныеРаботы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаРемонтныеРаботы.Ссылка КАК Ссылка,
	|	1 КАК Приоритет
	|ПОМЕСТИТЬ ВТ_Приоритеты
	|ИЗ
	|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	|ГДЕ
	|	смартЗаявкаНаРемонтныеРаботы.ДокументОснование = &ДокументОснование
	|	И НЕ смартЗаявкаНаРемонтныеРаботы.ПометкаУдаления
	|
	//rnp 31.08.2021 помеченные на удаление не показываем
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	смартЗаявкаНаРемонтныеРаботы.Ссылка,
	//|	2
	//|ИЗ
	//|	Документ.смартЗаявкаНаРемонтныеРаботы КАК смартЗаявкаНаРемонтныеРаботы
	//|ГДЕ
	//|	смартЗаявкаНаРемонтныеРаботы.ДокументОснование = &ДокументОснование
	//|	И смартЗаявкаНаРемонтныеРаботы.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МИНИМУМ(ВТ_Приоритеты.Приоритет) КАК Приоритет
	|ПОМЕСТИТЬ ВТ_МинимальныйПриоритет
	|ИЗ
	|	ВТ_Приоритеты КАК ВТ_Приоритеты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	ВТ_Приоритеты.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Приоритеты КАК ВТ_Приоритеты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МинимальныйПриоритет КАК ВТ_МинимальныйПриоритет
	|		ПО ВТ_Приоритеты.Приоритет = ВТ_МинимальныйПриоритет.Приоритет";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.Ссылка);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
КонецФункции //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписьсмартЗаявкаНаРемонтныеРаботы"
		ИЛИ ИмяСобытия = "Запись_ЗаказКлиента" Тогда
		
		ОбработкаОповещенияСервер(Параметр, Источник);
		
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаСервере
Процедура ОбработкаОповещенияСервер(Параметр, Источник)
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.смартЗаявкаНаРемонтныеРаботы") 
		И Источник.ДокументОснование = Объект.Ссылка Тогда
		
		ЗаявкаНаРемонтныеРаботы = Источник;
		Объект.Статус = Перечисления.смартСтатусыРегламентногоОбслуживания.ОформленаЗаявкаНаВыездИнженера;
		Модифицированность = Истина;
		
		ЭтотОбъект.Записать();
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ЗаказКлиента") 
		И Источник.ДокументОснование = Объект.Ссылка Тогда
		
		Объект.Статус = Перечисления.смартСтатусыРегламентногоОбслуживания.ВыставленСчетНаКомплект;
		Модифицированность = Истина;
		
		ЭтотОбъект.Записать();

	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаСервере
Процедура КлиентПриИзмененииНаСервере()
	
	Объект.НазначенныйМенеджерСЦ = Объект.Клиент.смартОсновнойМенеджерСервисЦентра;
	
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.НазначенныйМенеджерСЦ) Тогда
		КлиентПриИзмененииНаСервере();
	КонецЕсли;
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаКлиенте
Процедура ПослеДобавленияЗаметки(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Элементы.ЗаметкиПоДокументу.Обновить();
КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаКлиенте
Процедура ДокументОснованиеДокументОснованиеНажатие(Элемент, СтандартнаяОбработка)
	
	ЗаказКлиента = ПолучитьЗаказОснование(Объект.ДокументОснование);
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		ПоказатьЗначение(, ЗаказКлиента);
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 30.08.2021
&НаСервереБезКонтекста
Функция ПолучитьЗаказОснование(ДокументОснование)
	
	Возврат ДокументОснование.ДокументОснование;
	
КонецФункции //-- смарт:ММ 30.08.2021

//++ смарт:ММ 596 27.08.2021
&НаКлиенте
Процедура ПривязатьЗаказКлиентаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	ВыбранныйЗаказ = Неопределено;
	
	Если РезультатЗакрытия <> Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ВыбранныйЗаказ = РезультатЗакрытия;		
		
		ДокОснование = ПолучитьРеквизитОбъекта(ВыбранныйЗаказ, "ДокументОснование");
		
		Если ЗначениеЗаполнено(ДокОснование) Тогда
			
			Если ДокОснование = Объект.Ссылка Тогда
				ОбщегоНазначенияКлиент.СообщитьПользователю("В выбранном заказе клиента уже привязан текущий документ");
				Возврат;
			КонецЕсли;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ЗаказКлиента", ВыбранныйЗаказ);
			
			Оповещение = Новый ОписаниеОповещения("ВопросПередЗаполнениемДокументОснованияЗавершение", ЭтотОбъект, ДополнительныеПараметры);
			ТекстВопроса = НСтр("ru = 'В заказе клиента уже заполнен документ-основание. Заменить документ-основание на текущий?'");
			ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Иначе
			ЗаполнитьДокументОснованиеВЗаказе(ВыбранныйЗаказ);
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 27.08.2021
&НаКлиенте
Процедура ВопросПередЗаполнениемДокументОснованияЗавершение(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда	
		
		ЗаполнитьДокументОснованиеВЗаказе(ДополнительныеПараметры.ЗаказКлиента);		
	
	КонецЕсли;
	
КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 27.08.2021
&НаСервере
Процедура ЗаполнитьДокументОснованиеВЗаказе(ВыбранныйЗаказ)
	
	Модифицированность = Истина;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДокОбъект = ВыбранныйЗаказ.ПолучитьОбъект();
	ДокОбъект.ДокументОснование = Объект.Ссылка;
	
	Попытка
		Если ДокОбъект.Проведен Тогда
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
		
		Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыРегламентногоОбслуживания.ВыставленСчетНаКомплект");
		
		ЭтотОбъект.Записать();
		
		ОбщегоНазначения.СообщитьПользователю("Для документа " + ВыбранныйЗаказ + " указан документ-основание " + Объект.Ссылка, ВыбранныйЗаказ);
	Исключение
		ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ " + ВыбранныйЗаказ + Символы.ПС + ОписаниеОшибки(), ВыбранныйЗаказ);
	КонецПопытки;	
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 27.08.2021
&НаКлиенте
Процедура ОтвязатьЗаказКлиентаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
		
	Если РезультатЗакрытия <> Неопределено И ТипЗнч(РезультатЗакрытия) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		
		ОтвязатьОтЗаказаКлиентаЗапись(РезультатЗакрытия, Объект.Ссылка);
			
	КонецЕсли;

КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 27.08.2021
&НаСервере
Процедура ОтвязатьОтЗаказаКлиентаЗапись(ЗаказКлиента, ЗаявкаНаРемонтныеРаботы)
	
	Модифицированность = Истина;
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗначениеЗаполнено(ЗаказКлиента) Тогда
		
		ДокОбъект = ЗаказКлиента.ПолучитьОбъект();
		ДокОбъект.ДокументОснование = Неопределено;
		
		Попытка
			Если ДокОбъект.Проведен Тогда
				ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
			Объект.Статус = ПредопределенноеЗначение("Перечисление.смартСтатусыРегламентногоОбслуживания.ПовторныйЗвонокКлиенту");
			
			ЭтотОбъект.Записать();
			
			ОбщегоНазначения.СообщитьПользователю("Для документа " + ЗаказКлиента + " очищен документ-основание " + Объект.Ссылка, ЗаказКлиента);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Не удалось записать документ " + ЗаказКлиента + Символы.ПС + ОписаниеОшибки(), ЗаказКлиента);
		КонецПопытки;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
		
КонецПроцедуры //-- смарт:ММ 27.08.2021

//++ смарт:ММ 596 27.08.2021
&НаСервереБезКонтекста
Функция ПолучитьРеквизитОбъекта(СсылкаНаСправочник, ИмяРеквизита)
	
	Возврат СсылкаНаСправочник[ИмяРеквизита];
	
КонецФункции //-- смарт:ММ 27.08.2021
